AndroidCrypto/ESP32_Adafruit_PN532_Mifare_DESFire_EVx_Starter_Tutorial/Esp32_Adafruit_PN532_DESFire_Starter_v02/ESP32_DESFire.cpp

#include "ESP32_DESFire.h"
#include <Adafruit_PN532.h>

/////////////////////////////////////////////////////////////////////////////////////
//
// Basic functions for communicating with Mifare DESFire EVx cards
//
/////////////////////////////////////////////////////////////////////////////////////

ESP32_DESFire::ESP32_DESFire(Adafruit_PN532* nfc) {
  nfcLib = nfc;
}

/////////////////////////////////////////////////////////////////////////////////////
//
// Application management
//
/////////////////////////////////////////////////////////////////////////////////////

ESP32_DESFire::DF_StatusCode ESP32_DESFire::DF_Plain_SelectApplication(byte* aid) {

  uint8_t i;
  byte sendData[9];

  sendData[0] = 0x90;
  sendData[1] = DESFIRE_SELECT_APPLICATION;
  sendData[2] = 0x00;
  sendData[3] = 0x00;
  sendData[4] = 0x03;

  // copy the AID in parameter
  for (i = 0; i < 3; i++) {
    sendData[5 + i] = aid[i]; /* 3 byte AID */
  }
  sendData[8] = 0x00;

  byte backData[61];
  byte backLen = 61;

  DF_StatusCode statusCode;

  statusCode = DF_BasicTransceive(sendData, sizeof(sendData), backData, &backLen);

  if (statusCode != DF_STATUS_OK)
    return (DF_StatusCode)statusCode;

  if (backLen != 2)
    return DF_STATUS_ERROR;

  if (backData[backLen - 2] != 0x91 || backData[backLen - 1] != 0x00)
    return DF_InterpretErrorCode(&backData[backLen - 2]);

  return DF_STATUS_OK;
}

ESP32_DESFire::DF_StatusCode ESP32_DESFire::DF_Plain_CreateApplication(byte* aid, byte keySettings, byte appSettings) {
  uint8_t i;
  int8_t _aid[3];  // DESFire aid
  int8_t _aidLen;  // aid len = 3
  // Hang on to the aid data
  memcpy(_aid, aid, 3);
  _aidLen = 3;

  byte sendData[11];

  sendData[0] = 0x90;                        // CLA
  sendData[1] = DESFIRE_CREATE_APPLICATION;  // CMD DESFIRE_SELECT_APPLICATION (0xCA)
  sendData[2] = 0x00;                        // P1
  sendData[3] = 0x00;                        // P2
  sendData[4] = 0x05;                        // Lc

  // copy the AID in parameter
  for (i = 0; i < _aidLen; i++) {
    sendData[5 + i] = _aid[i];  // 3 byte AID
  }
  sendData[8] = keySettings;
  sendData[9] = appSettings;
  sendData[10] = 0x00;  // Le

  byte backData[61];
  byte backLen = 61;

  bool success;
  DF_StatusCode statusCode;

  statusCode = DF_BasicTransceive(sendData, sizeof(sendData), backData, &backLen);

  if (statusCode != DF_STATUS_OK)
    return (DF_StatusCode)statusCode;

  if (backLen < 2)
    return DF_WRONG_RESPONSE_LEN;

  if (backData[backLen - 2] != 0x91 || backData[backLen - 1] != 0x00)
    return DF_InterpretErrorCode(&backData[backLen - 2]);

  return DF_STATUS_OK;
}

// creates an application with 5 AES keys and default app settings
ESP32_DESFire::DF_StatusCode ESP32_DESFire::DF_Plain_CreateApplicationDefaultAes(byte* aid) {
  /**
   * for explanations on Master Key Settings see M075031_desfire.pdf page 35:
   * left '0' = Application master key authentication is necessary to change any key (default)
   * right 'f' = bits 3..0
   * bit 3: 1: this configuration is changeable if authenticated with the application master key (default setting)
   * bit 2: 1: CreateFile / DeleteFile is permitted also without application master key authentication (default setting)
   * bit 1: 1: GetFileIDs, GetFileSettings and GetKeySettings commands succeed independently of a preceding application master key authentication (default setting)
   * bit 0: 1: Application master key is changeable (authentication with the current application master key necessary, default setting)
  */
  byte keySettings = 0x0F;
  byte appSettings = 0x85;  // first nibble '8' = AES, second nibble '5' = 5 keys
  return DF_Plain_CreateApplication(aid, keySettings, appSettings);
};

/////////////////////////////////////////////////////////////////////////////////////
//
// Data File management
//
/////////////////////////////////////////////////////////////////////////////////////

ESP32_DESFire::DF_StatusCode ESP32_DESFire::DF_Plain_ReadData_Simple(byte fileNo, uint16_t length, byte offset, byte* backReadData, uint16_t* backReadLen) {
  ESP32_DESFire::DF_StatusCode df_statusCode;

  byte sendData[13];

  sendData[0] = 0x90;                    // CLA
  sendData[1] = DESFIRE_READ_DATA_FILE;  // CMD 0xAD
  sendData[2] = 0x00;                    // P1
  sendData[3] = 0x00;                    // P2
  sendData[4] = 0x07;                    // LC
  sendData[5] = fileNo;                  // FileNo
  sendData[6] = offset;                  // Offset
  sendData[7] = 0x00;                    // (Offset)
  sendData[8] = 0x00;                    // (Offset)
  sendData[9] = length;                  // Length
  sendData[10] = 0x00;                   // (Length)
  sendData[11] = 0x00;                   // (Length)
  sendData[12] = 0x00;                   // Le

  byte backData[MAX_BUFFER_SIZE];
  byte backLen = MAX_BUFFER_SIZE;

  DF_StatusCode statusCode;
  statusCode = DF_BasicTransceive(sendData, sizeof(sendData), backData, &backLen);

  if (statusCode != DF_STATUS_OK) {
    return (DF_StatusCode)statusCode;
  }

  if (backLen < 2) return DF_WRONG_RESPONSE_LEN;  // something gone wrong

  if (backData[backLen - 2] == 0x91 && backData[backLen - 1] != DF_STATUS_OK) {
    *backReadLen = 0;
    return DF_InterpretErrorCode(&backData[backLen - 2]);
  }

  // at this point our data is complete
  if ((backLen - 2) != length) {
    return DF_WRONG_RESPONSE_LEN;
  }

  if (*backReadLen < length) {
    return DF_STATUS_NO_ROOM;
  }

  if (backLen > 0)
    memcpy(backReadData, backData, length);
  *backReadLen = length;

  return DF_STATUS_OK;
}

void ESP32_DESFire::hexCharacterStringToBytes(byte* byteArray, const char* hexString) {
  bool oddLength = strlen(hexString) & 1;

  byte currentByte = 0;
  byte byteIndex = 0;

  for (byte charIndex = 0; charIndex < strlen(hexString); charIndex++) {
    bool oddCharIndex = charIndex & 1;

