AndroidCrypto/ESP32_Adafruit_PN532_Mifare_DESFire_EVx_Starter_Tutorial/Esp32_Adafruit_PN532_DESFire_Starter_v02/ESP32_DESFire.cpp
    if (oddLength) {
      // If the length is odd
      if (oddCharIndex) {
        // odd characters go in high nibble
        currentByte = nibble(hexString[charIndex]) << 4;
      } else {
        // Even characters go into low nibble
        currentByte |= nibble(hexString[charIndex]);
        byteArray[byteIndex++] = currentByte;
        currentByte = 0;
      }
    } else {
      // If the length is even
      if (!oddCharIndex) {
        // Odd characters go into the high nibble
        currentByte = nibble(hexString[charIndex]) << 4;
      } else {
        // Odd characters go into low nibble
        currentByte |= nibble(hexString[charIndex]);
        byteArray[byteIndex++] = currentByte;
        currentByte = 0;
      }
    }
  }
}

byte ESP32_DESFire::nibble(char c) {
  if (c >= '0' && c <= '9')
    return c - '0';

  if (c >= 'a' && c <= 'f')
    return c - 'a' + 10;

  if (c >= 'A' && c <= 'F')
    return c - 'A' + 10;

  return 0;  // Not a valid hexadecimal character
}

void ESP32_DESFire::dumpByteArray(const byte* byteArray, const byte arraySize) {

  for (int i = 0; i < arraySize; i++) {
    Serial.print("0x");
    if (byteArray[i] < 0x10)
      Serial.print("0");
    Serial.print(byteArray[i], HEX);
    Serial.print(", ");
  }
  Serial.println();
}

ESP32_DESFire::DF_StatusCode ESP32_DESFire::DF_Plain_WriteData_Simple(byte fileNo, byte length, byte offset, byte* sendData) {

  byte* sendData2 = new byte[length + 13];

  sendData2[0] = 0x90;                     // CLA
  sendData2[1] = DESFIRE_WRITE_DATA_FILE;  // CMD 0x8D
  sendData2[2] = 0x00;                     // P1
  sendData2[3] = 0x00;                     // P2
  sendData2[4] = 7 + length;               // Lc
  sendData2[5] = fileNo;                   // FileNo
  sendData2[6] = offset;                   // Offset
  sendData2[7] = 0x00;                     // (Offset)
  sendData2[8] = 0x00;                     // (Offset)
  sendData2[9] = length;                   // Length
  sendData2[10] = 0x00;                    // (Length)
  sendData2[11] = 0x00;                    // (Length)
  memcpy(&sendData2[12], sendData, length);
  sendData2[length + 12] = 0x00;  // Le

  byte backData[64];
  byte backLen = 64;

  ESP32_DESFire::DF_StatusCode statusCode;
  statusCode = DF_BasicTransceive(sendData2, length + 13, backData, &backLen);

  delete[] sendData2;

  if (statusCode != DF_STATUS_OK)
    return (DF_StatusCode)statusCode;

  if (backData[backLen - 2] != 0x91 || backData[backLen - 1] != 0x00)
    return DF_InterpretErrorCode(&backData[backLen - 2]);

  if (backLen != 2)
    return DF_WRONG_RESPONSE_LEN;

  return DF_STATUS_OK;
}

// Note: the maximal length is 255 bytes as no int to LSB conversion is done
ESP32_DESFire::DF_StatusCode ESP32_DESFire::DF_Plain_CreateStandardDataFile(byte fileNo, DF_CommMode commMode, byte accessRightsRwCar, byte accessRightsRW, byte length) {
  return DF_Plain_CreateDataFile_native(DESFIRE_CREATE_STANDARD_DATA_FILE, fileNo, commMode, accessRightsRwCar, accessRightsRW, length);
}

ESP32_DESFire::DF_StatusCode ESP32_DESFire::DF_Plain_CreateStandardFileDefault32(byte fileNo, DF_CommMode commMode) {
  byte accessRightsRwCar = 0x12;  // key 1 has R&W access rights, key 2 has CAR rights
  byte accessRightsRW = 0x34;     // key 3 has R, key 4 has W access rights
  byte length = 0x20;             // 32 bytes
  return DF_Plain_CreateStandardDataFile(fileNo, commMode, accessRightsRwCar, accessRightsRW, length);
}

// This gives a Standard File with free accessible data
ESP32_DESFire::DF_StatusCode ESP32_DESFire::DF_Plain_CreateStandardFileDefaultSized(byte fileNo, byte fileSize, DF_CommMode commMode) {
  byte accessRightsRwCar = 0x12;  // key 1 has R&W access rights, key 2 has CAR rights
  byte accessRightsRW = 0x34;     // key 3 has R, key 4 has W access rights
  return DF_Plain_CreateStandardDataFile(fileNo, commMode, accessRightsRwCar, accessRightsRW, fileSize);
}

ESP32_DESFire::DF_StatusCode ESP32_DESFire::DF_Plain_CreateStandardFileDefaultFreeAccessSized(byte fileNo, byte fileSize, DF_CommMode commMode) {
  byte accessRightsRwCar = 0xEE;  // key 1 has R&W access rights, key 2 has CAR rights
  byte accessRightsRW = 0xEE;     // key 3 has R, key 4 has W access rights
  return DF_Plain_CreateStandardDataFile(fileNo, commMode, accessRightsRwCar, accessRightsRW, fileSize);
}

// Note: the maximal length is 255 bytes as no int to LSB conversion is implemented
ESP32_DESFire::DF_StatusCode ESP32_DESFire::DF_Plain_CreateDataFile_native(byte Cmd, byte fileNo, DF_CommMode commMode, byte accessRightsRwCar, byte accessRightsRW, byte length) {
  byte sendData[13];

  sendData[0] = 0x90;               // CLA
  sendData[1] = Cmd;                // Standard Data: 0xCD or Backup Data: 0xCB
  sendData[2] = 0x00;               // P1
  sendData[3] = 0x00;               // P2
  sendData[4] = 0x07;               // LC
  sendData[5] = fileNo;             // FileNo
  sendData[6] = commMode;           // CommunicationMode 00 = Plain, 01 = MAC, 03 = Full
  sendData[7] = accessRightsRwCar;  // Access Rights for R&W and CAR keys
  sendData[8] = accessRightsRW;     // Access Rights for R and W keys
  sendData[9] = length;             // Length LSB
  sendData[10] = 0x00;              // (Length) ### needs an int -> LSB conversion
  sendData[11] = 0x00;              // (Length)
  sendData[12] = 0x00;              // Le

  byte backData[61];
  byte backLen = 61;

  DF_StatusCode statusCode;
  statusCode = DF_BasicTransceive(sendData, sizeof(sendData), backData, &backLen);

  if (statusCode != DF_STATUS_OK)
    return (DF_StatusCode)statusCode;

  if (backData[backLen - 2] != 0x91 || backData[backLen - 1] != 0x00)
    return DF_InterpretErrorCode(&backData[backLen - 2]);

  if (backLen > length + 2)
    return DF_WRONG_RESPONSE_LEN;

  return DF_STATUS_OK;
}

ESP32_DESFire::DF_StatusCode ESP32_DESFire::DF_Plain_GetFileSettings(byte fileNo, byte* backRespData, byte* backRespLen) {
  byte sendData[7];

  sendData[0] = 0x90;                       // CLA
  sendData[1] = DESFIRE_GET_FILE_SETTINGS;  // CMD 0xF5
  sendData[2] = 0x00;                       // P1
  sendData[3] = 0x00;                       // P2
  sendData[4] = 0x01;                       // Lc
  sendData[5] = fileNo;                     // FileNo
  sendData[6] = 0x00;                       // Le

  byte backData[61];
  byte backLen = 61;

  DF_StatusCode statusCode;
  statusCode = DF_BasicTransceive(sendData, sizeof(sendData), backData, &backLen);

