AndroidCrypto/ESP32_Adafruit_PN532_Mifare_DESFire_EVx_Starter_Tutorial/Esp32_Adafruit_PN532_DESFire_Starter_v02/ESP32_DESFire.cpp
  if (statusCode != DF_STATUS_OK)
    return (DF_StatusCode)statusCode;

  if (backData[backLen - 2] != 0x91 || backData[backLen - 1] != 0x00)
    return DF_InterpretErrorCode(&backData[backLen - 2]);

  if (backLen < 9 || backLen > 36)
    return DF_WRONG_RESPONSE_LEN;

  if (*backRespLen < backLen - 2)
    return DF_STATUS_NO_ROOM;

  memcpy(backRespData, backData, backLen - 2);
  *backRespLen = backLen - 2;

  fileSettingsIsValid = false;  // invalidate the old data
  DF_GetFileSettingsAnalyzer(fileNo, backData, backLen - 10);

  return DF_STATUS_OK;
}

void ESP32_DESFire::DF_FileSettingsDebugPrint() {
  Serial.printf("File Settings for file %02x\n", fileSettingsFileNo);
  if (!fileSettingsIsValid) {
    Serial.println("The FileSettings for this file are INVALID, aborting");
    return;
  }
  Serial.printf("File Type         : %02x ", fileSettingsFileType);
  if (fileSettingsFileType == 0x00) {
    Serial.println("(Standard Data File)");
  } else if (fileSettingsFileType == 0x01) {
    Serial.println("(Backup Data File)");
  } else if (fileSettingsFileType == 0x02) {
    Serial.println("(Value File)");
  } else if (fileSettingsFileType == 0x03) {
    Serial.println("(Linear Record File)");
  } else if (fileSettingsFileType == 0x04) {
    Serial.println("(Cyclic Record File)");
  } else if (fileSettingsFileType == 0x05) {
    Serial.println("(Transaction MAC File)");
  } else {
    Serial.println("(Unknown File Type)");
  }
  Serial.printf("File Options      : %02X\n", fileSettingsFileOptions);
  if (isFilePlainCommunicationMode) {
    Serial.println("File Comm Mode    : PLAIN");
  } else if (isFileMacCommunicationMode) {
    Serial.println("File Comm Mode    : MAC");
  } else {
    Serial.println("File Comm Mode    : FULL encrypted");
  }
  Serial.printf("File RW/CAR AccRg : %02X\n", fileSettingsRwCarAccessRights);
  Serial.printf("File R/W    AccRg : %02X\n", fileSettingsRWAccessRights);
  if ((fileSettingsFileType == 0x00) || (fileSettingsFileType == 0x01)) {
    // data file
    Serial.printf("File Size         : %d\n", fileSettingsFileSize);
  } else if (fileSettingsFileType == 0x02) {
    // value file
    Serial.printf("File Size         : %d\n", fileSettingsFileSize);
    Serial.printf("Lower Limit       : %d\n", fileSettingsLowerLimit);
    Serial.printf("Upper Limit       : %d\n", fileSettingsUpperLimit);
    Serial.printf("Limited Credit    : %d\n", fileSettingsLimitedCreditValue);
    if (fileSettingsIsLimitedCreditEnabled) {
      Serial.println("Limtd Cred Enabld : YES");
    } else {
      Serial.println("Limtd Cred Enabld : NO");
    }
    if (fileSettingsIsFreeAccessToGetValue) {
      Serial.println("FreeAccess GetVal : YES");
    } else {
      Serial.println("FreeAccess GetVal : NO");
    }
  } else if ((fileSettingsFileType == 0x03) || (fileSettingsFileType == 0x04)) {
    // record file
    Serial.printf("File Record Size  : %d\n", fileSettingsRecordSize);
    Serial.printf("Max No of Records : %d\n", fileSettingsMaxNoOfRecs);
    Serial.printf("Cur No of Records : %d\n", fileSettingsCurrentNoOfRecs);
  }
}

// This does include just a subset of possible error codes
void ESP32_DESFire::DF_StatusCodeDebugPrint(DF_StatusCode statusCode) {
  switch (statusCode) {
    case DF_STATUS_OK: Serial.println("SUCCESS"); break;
    case PERMISSION_DENIED: Serial.println("PERMISSION_DENIED ERROR"); break;
    case FILE_NOT_FOUND: Serial.println("FILE/APP NOT FOUND ERROR"); break;
    case DUPLICATE_ERROR: Serial.println("DUPLICATE ERROR"); break;
    default: Serial.println("FAIL (not categorized)"); break;
  }
}

// This is a GetFileSettings response analyzer. Please call it on DF_STATUS_OK result from
// GetFileSettings only.
bool ESP32_DESFire::DF_GetFileSettingsAnalyzer(byte fileNo, byte* resData, uint8_t resLen) {

  // get the data if the response is long enough
  if (resLen >= 7) {
    fileSettingsFileNo = fileNo;
    fileSettingsFileType = resData[0];
    fileSettingsFileOptions = resData[1];
    // determine the communication mode on bits 0 and 1
    // see NTAG 424 DNA data sheet, page 70 and 13
    /*
Communication mode - Bit Representation
CommMode.Plain     - 00b // X0b means 0 or 1 for X
CommMode.Plain     - 10b // X0b means 0 or 1 for X
CommMode.MAC       - 01b 
CommMode.Full      - 11b
*/
    // reset
    isFilePlainCommunicationMode = false;
    isFileMacCommunicationMode = false;
    isFileFullCommunicationMode = false;
    bool isBit0 = bitRead(fileSettingsFileOptions, 0);
    bool isBit1 = bitRead(fileSettingsFileOptions, 1);
    if (!isBit0) {
      isFilePlainCommunicationMode = true;
    } else {
      if (!isBit1) {
        isFileMacCommunicationMode = true;
      } else {
        isFileFullCommunicationMode = true;
      }
    }
    fileSettingsRwCarAccessRights = resData[2];
    fileSettingsRWAccessRights = resData[3];
    if ((fileSettingsFileType == 0x00) || (fileSettingsFileType == 0x01)) {
      // data file
      fileSettingsFileSize = resData[4] + (resData[5] * 256) + (resData[6] * 65536);
      fileSettingsIsValid = true;
    } else if (fileSettingsFileType == 0x02) {
      // value file
      fileSettingsLowerLimit = resData[4] + (resData[5] * 256) + (resData[6] * 65536) + (resData[7] * 16777216);
      fileSettingsUpperLimit = resData[8] + (resData[9] * 256) + (resData[10] * 65536) + (resData[11] * 16777216);
      fileSettingsLimitedCreditValue = resData[12] + (resData[13] * 256) + (resData[14] * 65536) + (resData[15] * 16777216);
      fileSettingsIsLimitedCreditEnabled = bitRead(resData[16], 0);
      fileSettingsIsFreeAccessToGetValue = bitRead(resData[16], 1);
      fileSettingsIsValid = true;
    } else if ((fileSettingsFileType == 0x03) || (fileSettingsFileType == 0x04)) {
      if (resLen >= 13) {
        fileSettingsRecordSize = resData[4] + (resData[5] * 256) + (resData[6] * 65536);
        fileSettingsMaxNoOfRecs = resData[7] + (resData[8] * 256) + (resData[9] * 65536);
        fileSettingsCurrentNoOfRecs = resData[10] + (resData[11] * 256) + (resData[12] * 65536);
        fileSettingsIsValid = true;
      } else {
        fileSettingsIsValid = false;
      }
    }
  } else {
    fileSettingsIsValid = false;
  }
  return fileSettingsIsValid;
}

/////////////////////////////////////////////////////////////////////////////////////
//
// PICC management
//
/////////////////////////////////////////////////////////////////////////////////////

// Writes to backRespData 28 or 29 bytes according to tables 54, 56, 58 from NT4H2421Gx (NTAG 424 DNA) datasheet:
// VendorID, HWType, HWSubType, HWMajorVersion, HWMinorVersion, HWStorageSize, HWProtocol,
// VendorID, SWType, SWSubType, SWMajorVersion, SWMinorVersion, SWStorageSize, SWProtocol,
// UID(7), BatchNo(4), BatchNo/FabKey, FabKey/CWProd, YearProd, [FabKeyID]
// Note: arguments in brackets are optional; SW1 and SW2 are not included in backRespData

