AndroidCrypto/ESP32_Adafruit_PN532_Mifare_DESFire_EVx_Starter_Tutorial/Esp32_Adafruit_PN532_DESFire_Starter_v02/ESP32_DESFire.cpp
ESP32_DESFire::DF_StatusCode ESP32_DESFire::DF_Plain_GetVersion(byte* backRespData, byte* backRespLen) {
  byte backData[29];
  byte backLen;

  ESP32_DESFire::DF_StatusCode statusCode;
  statusCode = DF_Plain_GetVersion_native(DESFIRE_GET_VERSION, DESFIRE_GET_MORE_DATA, backData, &backLen);

  if (statusCode != DF_STATUS_OK)
    return statusCode;

  if (backLen != 7)
    return DF_WRONG_RESPONSE_LEN;

  statusCode = DF_Plain_GetVersion_native(DESFIRE_GET_MORE_DATA, DESFIRE_GET_MORE_DATA, &backData[7], &backLen);

  if (statusCode != DF_STATUS_OK)
    return statusCode;

  if (backLen != 7)
    return DF_WRONG_RESPONSE_LEN;

  statusCode = DF_Plain_GetVersion_native(DESFIRE_GET_MORE_DATA, DESFIRE_SV2_OK, &backData[14], &backLen);

  if (statusCode != DF_STATUS_OK)
    return statusCode;

  if (backLen != 14 && backLen != 15)
    return DF_WRONG_RESPONSE_LEN;

  if (*backRespLen < backLen + 14)
    return DF_STATUS_NO_ROOM;

  memcpy(backRespData, backData, backLen + 14);
  *backRespLen = backLen + 14;

  return DF_STATUS_OK;
}

ESP32_DESFire::DF_StatusCode ESP32_DESFire::DF_Plain_GetVersion_native(byte Cmd, byte expectedSV2, byte* backRespData, byte* backRespLen) {
  byte sendData[5];

  sendData[0] = 0x90;  // CLA
  sendData[1] = Cmd;   // CMD
  sendData[2] = 0x00;  // P1
  sendData[3] = 0x00;  // P2
  sendData[4] = 0x00;  // Le

  byte backData[61];
  byte backLen = 61;
  DF_StatusCode statusCode;

  statusCode = DF_BasicTransceive(sendData, sizeof(sendData), backData, &backLen);

  if (statusCode != DF_STATUS_OK)
    return (DF_StatusCode)statusCode;

  if (backData[backLen - 2] != 0x91 || backData[backLen - 1] != expectedSV2)
    return DF_InterpretErrorCode(&backData[backLen - 2]);

  if (backLen != 9 && backLen != 16 && backLen != 17 && backLen != 24 && backLen != 25)
    return DF_WRONG_RESPONSE_LEN;

  memcpy(backRespData, backData, backLen - 2);
  *backRespLen = backLen - 2;

  return DF_STATUS_OK;
}

ESP32_DESFire::DF_StatusCode ESP32_DESFire::DF_Plain_GetFreeMemory(byte* backRespData, byte* backRespLen) {
  byte sendData[5];

  sendData[0] = 0x90;                     // CLA
  sendData[1] = DESFIRE_GET_FREE_MEMORY;  // CMD 0x6E
  sendData[2] = 0x00;                     // P1
  sendData[3] = 0x00;                     // P2
  sendData[4] = 0x00;                     // Le

  byte backData[61];
  byte backLen = 61;
  DF_StatusCode statusCode;
  statusCode = DF_BasicTransceive(sendData, sizeof(sendData), backData, &backLen);

  if (statusCode != DF_STATUS_OK)
    return statusCode;

  if (backLen < 2)
    return DF_WRONG_RESPONSE_LEN;

  if (backData[backLen - 2] != 0x91 || backData[backLen - 1] != 0x00)
    return DF_InterpretErrorCode(&backData[backLen - 2]);

  if (backLen != 5)
    return DF_WRONG_RESPONSE_LEN;

  memcpy(backRespData, backData, backLen - 2);
  *backRespLen = backLen - 2;

  return DF_STATUS_OK;
}

// This is returning the full response, not just the data without status codes
ESP32_DESFire::DF_StatusCode ESP32_DESFire::DF_Plain_GetMoreData_native(byte* backRespData, byte* backRespLen) {
  byte sendData[5];

  sendData[0] = 0x90;                   // CLA
  sendData[1] = DESFIRE_GET_MORE_DATA;  // CMD 0xAF
  sendData[2] = 0x00;                   // P1
  sendData[3] = 0x00;                   // P2
  sendData[4] = 0x00;                   // Le

  byte backData[61];
  byte backLen = 61;
  DF_StatusCode statusCode;

  statusCode = DF_BasicTransceive(sendData, sizeof(sendData), backData, &backLen);

  if (statusCode != DF_STATUS_OK)
    return (DF_StatusCode)statusCode;

  memcpy(backRespData, backData, backLen);  // return the complete response
  *backRespLen = backLen;

  if (backData[backLen - 2] == 0x91 && backData[backLen - 1] == 0xAF) {
    Serial.println("Get_More_Data Returning ADDITIONAL_FRAME");
    return ADDITIONAL_FRAME;
  } else if (backData[backLen - 2] == 0x91 && backData[backLen - 1] == 0x00) {
    Serial.println("Get_More_Data Returning DF_STATUS_OK");
    return DF_STATUS_OK;
  } else {
    return DF_UNKNOWN_ERROR;
  }
}

void ESP32_DESFire::convertLargeInt2Uint8_t4Lsb(int& input, uint8_t* output) {
  int max2Byte = 65536;
  int highInt = input / max2Byte;
  int lowInt = input % max2Byte;
  uint8_t highUint8[2];
  convertInt2Uint8_t(highInt, highUint8);
  uint8_t lowUint8[2];
  convertInt2Uint8_t(lowInt, lowUint8);
  uint8_t convertedInt[4];
  convertedInt[3] = highUint8[0];
  convertedInt[2] = highUint8[1];
  convertedInt[1] = lowUint8[0];
  convertedInt[0] = lowUint8[1];
  int i;
  for (i = 0; i < 4; i++) {
    output[i] = convertedInt[i];
  }
}

// maximum int is 65535
void ESP32_DESFire::convertInt2Uint8_t(int& input, uint8_t* output) {
  byte high = highByte(input);
  byte low = lowByte(input);
  //uint8_t uint8_22[2];
  output[0] = high;
  output[1] = low;
}

int ESP32_DESFire::convertUint8_t3_2IntLsb(byte* input) {
  int outputValue = 0;
  outputValue += input[0];
  outputValue += (input[1] * 256);
  outputValue += (input[2] * 65536);
  //output = outputValue;
  return outputValue;
}

int ESP32_DESFire::convertUint8_t4_2IntLsb(byte* input) {
  int outputValue = 0;
  outputValue += input[0];
  outputValue += (input[1] * 256);
  outputValue += (input[2] * 65536);
  outputValue += (input[3] * 16777216);
  return outputValue;
}

void ESP32_DESFire::convertIntTo3BytesLsb(int input, byte* output) {
  byte* out = new byte[3];
  if (input > 16777215) {
    memset(output, 0, 3);
    //memcpy(output, out, 3);
    return;
  }
  out[0] = input & 0xff;
  out[1] = (input >> 8) & 0xff;
  out[2] = (input >> 16) & 0xff;
  memcpy(output, out, 3);
}

void ESP32_DESFire::revertAid(byte* aid, byte* revertAid) {
  byte aidRevert[3];
  aidRevert[0] = aid[2];
  aidRevert[1] = aid[1];
  aidRevert[2] = aid[0];
  memcpy(revertAid, aidRevert, 3);
}

/////////////////////////////////////////////////////////////////////////////////////
//
// Protected functions
//
/////////////////////////////////////////////////////////////////////////////////////

