AndroidCrypto/ESP32_Adafruit_PN532_Mifare_DESFire_EVx_Starter_Tutorial/Esp32_Adafruit_PN532_DESFire_Starter_v02/ESP32_DESFire.cpp
ESP32_DESFire::DF_StatusCode ESP32_DESFire::DF_BasicTransceive(byte* sendData, byte sendLen, byte* backData, byte* backLen) {
  ESP32_DESFire::DF_StatusCode result;
  bool success;
  DF_StatusCode statusCode;
  byte bLen = 255;  // ### changed from 61 to 255
  if (COMM_DEBUG_PRINT) {
    Serial.printf("Send length %d\n", sendLen);
    printHex(sendData, sendLen);
    Serial.println("");
  }
  success = nfcLib->inDataExchange(sendData, sendLen, backData, &bLen);
  if (COMM_DEBUG_PRINT) {
    Serial.printf("Recv length %d\n", bLen);
    printHex(backData, bLen);
    Serial.println("");
    *backLen = bLen;
    return DF_STATUS_OK;
  } else {
    *backLen = 0;
    return DF_STATUS_ERROR;
  }
}

ESP32_DESFire::DF_StatusCode ESP32_DESFire::DF_InterpretErrorCode(byte* SW1_2) {
  uint16_t SW = SW1_2[0] << 8 | SW1_2[1];
  switch (SW) {
    case 0x6581:
      return ESP32_DESFire::MEMORY_ERROR;
    case 0x6700:
      return ESP32_DESFire::LENGTH_ERROR;
    case 0x6982:
      return ESP32_DESFire::SECURITY_NOT_SATISFIED;
    case 0x6985:
      return ESP32_DESFire::CONDITIONS_NOT_SATISFIED;
    case 0x6A82:
      return ESP32_DESFire::FILE_OR_APP_NOT_FOUND;
    case 0x6A86:
      return ESP32_DESFire::INCORRECT_PARAMS;
    case 0x6A87:
      return ESP32_DESFire::INCORRECT_LC;
    case 0x6A00:
      return ESP32_DESFire::CLA_NOT_SUPPORTED;
    case 0x910B:
      return ESP32_DESFire::COMMAND_NOT_FOUND;
    case 0x910C:
      return ESP32_DESFire::COMMAND_FORMAT_ERROR;
    case 0x911C:
      return ESP32_DESFire::ILLEGAL_COMMAND_CODE;
    case 0x911E:
      return ESP32_DESFire::INTEGRITY_ERROR;
    case 0x9140:
      return ESP32_DESFire::NO_SUCH_KEY;
    case 0x917E:
      return ESP32_DESFire::LENGTH_ERROR;
    case 0x919D:
      return ESP32_DESFire::PERMISSION_DENIED;
    case 0x919E:
      return ESP32_DESFire::PARAMETER_ERROR;
    case 0x91AD:
      return ESP32_DESFire::AUTHENTICATION_DELAY;
    case 0x91AE:
      return ESP32_DESFire::AUTHENTICATION_ERROR;
    case 0x91AF:
      return ESP32_DESFire::ADDITIONAL_FRAME;
    case 0x91BE:
      return ESP32_DESFire::BOUNDARY_ERROR;
    case 0x91CA:
      return ESP32_DESFire::COMMAND_ABORTED;
    case 0x91EE:
      return ESP32_DESFire::MEMORY_ERROR;
    case 0x91F0:
      return ESP32_DESFire::FILE_NOT_FOUND;
    case 0x91DE:
      return ESP32_DESFire::DUPLICATE_ERROR;
    case 0x910E:
      return ESP32_DESFire::OUT_OF_EEPROM_ERROR;
    default:
      return ESP32_DESFire::DF_UNKNOWN_ERROR;
  }
}

/////////////////////////////////////////////////////////////////////////////////////
//
// Internal management
//
/////////////////////////////////////////////////////////////////////////////////////

void ESP32_DESFire::printHex(byte* buffer, uint16_t bufferSize) {
  for (uint16_t i = 0; i < bufferSize; i++) {
    Serial.print(buffer[i] < 0x10 ? " 0" : " ");
    Serial.print(buffer[i], HEX);
  }
}
